In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Downloads/data/enrolment_1.csv')
df

           id  year           course name
0     2777729     1               science
1     2777730     2               science
2     2777765     1                  arts
3     2777766     2                  arts
4     2777785     1                   mba
...       ...   ...                   ...
1995  2796805     3  computer application
1996  2796812     1               nursing
1997  2796813     2               nursing
1998  2796814     3               nursing
1999  2796815     4               nursing

[2000 rows x 3 columns]

In [3]:
df['status']="allowed"
df

           id  year           course name   status
0     2777729     1               science  allowed
1     2777730     2               science  allowed
2     2777765     1                  arts  allowed
3     2777766     2                  arts  allowed
4     2777785     1                   mba  allowed
...       ...   ...                   ...      ...
1995  2796805     3  computer application  allowed
1996  2796812     1               nursing  allowed
1997  2796813     2               nursing  allowed
1998  2796814     3               nursing  allowed
1999  2796815     4               nursing  allowed

[2000 rows x 4 columns]

“information technology” 과목은 심화과목이라 1학년은 수강할 수 없습니다.
“commerce” 과목은 기초과목이고 많은 학생들이 듣는 수업이라 4학년은 수강할 수 없습니다.

In [5]:
infotech = (df['year'] == 1) & (df['course name'] == 'information technology')
commerce = (df['year'] == 4) & (df['course name'] == 'commerce')
df.loc[infotech, 'status'] = "not allowed"
df.loc[commerce, 'status'] = "not allowed"
df

           id  year           course name   status
0     2777729     1               science  allowed
1     2777730     2               science  allowed
2     2777765     1                  arts  allowed
3     2777766     2                  arts  allowed
4     2777785     1                   mba  allowed
...       ...   ...                   ...      ...
1995  2796805     3  computer application  allowed
1996  2796812     1               nursing  allowed
1997  2796813     2               nursing  allowed
1998  2796814     3               nursing  allowed
1999  2796815     4               nursing  allowed

[2000 rows x 4 columns]

수강생이 5명이 되지 않으면 강의는 폐강되어 수강할 수 없습니다.
#status = "allowed" 가 5개 미만인 course name은 not allowed로 바꿔야 한다 이거지

In [9]:
allowed_course = df['status'] == "allowed"
allowed_course

0       True
1       True
2       True
3       True
4       True
        ...
1995    True
1996    True
1997    True
1998    True
1999    True
Name: status, Length: 2000, dtype: bool

allowed_course가 True인, 'course name'의 수는? 이거네

In [10]:
counts = df.loc[allowed_course,'course name'].value_counts()
counts

arts                               158
science                            124
commerce                           101
english                             56
education                           41
                                  ...
library & information & science      1
physical edu.                        1
dcl                                  1
technician                           1
punjabi                              1
Name: course name, Length: 296, dtype: int64

In [12]:
counts[counts<5].index

Index(['mech', 'electronics and communication', 'environment', 'bpt',
       'electrical and electronics engineering', 'refactoring', 'agriculture',
       'instrumentation engineering', 'electronics and instrumentation',
       'mechanical engg.',
       ...
       'b.ed', 'statistics', 'sciences', 'aih', 'full time',
       'library & information & science', 'physical edu.', 'dcl', 'technician',
       'punjabi'],
      dtype='object', length=214)

In [16]:
closed_course = list(counts[counts<5].index)

counts 중에서 counts가 5가 안되는 애들의 index를 뽑고 closed_course가 리스트니까 한 요소당 반복문 for써서 not allowed로 바꿔주는 것이지요

In [17]:
for course in closed_course :
    df.loc[df['course name'] == course, 'status'] = "not allowed"
df

           id  year           course name   status
0     2777729     1               science  allowed
1     2777730     2               science  allowed
2     2777765     1                  arts  allowed
3     2777766     2                  arts  allowed
4     2777785     1                   mba  allowed
...       ...   ...                   ...      ...
1995  2796805     3  computer application  allowed
1996  2796812     1               nursing  allowed
1997  2796813     2               nursing  allowed
1998  2796814     3               nursing  allowed
1999  2796815     4               nursing  allowed

[2000 rows x 4 columns]

In [21]:
students = df['status'] == "allowed"
course_students = df.loc[students,'course name'].value_counts()
course_students

arts                                   158
science                                124
commerce                               101
english                                 56
education                               41
                                      ...
mca                                      5
dental                                   5
building construction and mangement      5
music                                    5
nanotechnology                           5
Name: course name, Length: 82, dtype: int64

In [22]:
auditorium = list(course_students[course_students >= 80].index)
large_room = list(course_students[(course_students < 80) & (course_students >= 40 )].index)
medium_room = list(course_students[(course_students < 40) & (course_students >= 15 )].index)
small_room = list(course_students[(course_students < 15) & (course_students >= 5 )].index)

In [25]:
no_student = df['status'] == "not allowed"
df.loc[no_student,'room assignment'] = "not assigned"

for course in auditorium :
    df.loc[(df['course name']==course) & students, 'room assignment'] = "Auditorium"
for course in large_room :
    df.loc[(df['course name']==course) & students, 'room assignment'] = "Large room"
for course in medium_room :
    df.loc[(df['course name']==course) & students, 'room assignment'] = "Medium room"
for course in small_room :
    df.loc[(df['course name']==course) & students, 'room assignment'] = "Small room"
    
df

           id  year           course name   status room assignment
0     2777729     1               science  allowed      Auditorium
1     2777730     2               science  allowed      Auditorium
2     2777765     1                  arts  allowed      Auditorium
3     2777766     2                  arts  allowed      Auditorium
4     2777785     1                   mba  allowed      Small room
...       ...   ...                   ...      ...             ...
1995  2796805     3  computer application  allowed     Medium room
1996  2796812     1               nursing  allowed     Medium room
1997  2796813     2               nursing  allowed     Medium room
1998  2796814     3               nursing  allowed     Medium room
1999  2796815     4               nursing  allowed     Medium room

[2000 rows x 5 columns]

In [26]:
df['room assignment'].value_counts()

not assigned    552
Medium room     531
Small room      437
Auditorium      383
Large room       97
Name: room assignment, dtype: int64

In [28]:
students = df['status'] == "allowed"
course_counts = df.loc[students,'course name'].value_counts()
course_counts

arts                                   158
science                                124
commerce                               101
english                                 56
education                               41
                                      ...
mca                                      5
dental                                   5
building construction and mangement      5
music                                    5
nanotechnology                           5
Name: course name, Length: 82, dtype: int64

In [53]:
auditorium_list = list(course_counts[course_counts >= 80].index)
large_room_list = list(course_counts[(80 > course_counts) & (course_counts >= 40)].index)
medium_room_list = list(course_counts[(40 > course_counts) & (course_counts >= 15)].index)
small_room_list = list(course_counts[(15 > course_counts) & (course_counts > 4)].index)

for i in range(len(auditorium_list)):
    df.loc[(df["course name"] == sorted(auditorium_list)[i]) & allowed, "room assignment"] = "Auditorium-" + str(i + 1)

for i in range(len(large_room_list)):
    df.loc[(df["course name"] == sorted(large_room_list)[i]) & allowed, "room assignment"] = "Large-" + str(i + 1)
    
for i in range(len(medium_room_list)):
    df.loc[(df["course name"] == sorted(medium_room_list)[i]) & allowed, "room assignment"] = "Medium-" + str(i + 1)
    
for i in range(len(small_room_list)):
    df.loc[(df["course name"] == sorted(small_room_list)[i]) & allowed, "room assignment"] = "Small-" + str(i + 1)

NameError: name 'course_counts' is not defined